<!-- dflook/terraform-github-actions {"workspace":"plan-summary-outputs-2","backend":"ad1850f880b5d850d33a1459dffa21103b8113a93f487dc27ceece3bca0d856b","backend_type":"remote"} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __plan-summary-outputs-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables="from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.the_id will be created
  + resource "random_id" "the_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + default        = "default"
  + from_tfvars    = "from_tfvars"
  + from_variables = "from_variables"
```
</details>

:memo: Plan generated in [Test Terraform cloud #17](https://github.com/dflook/terraform-github-actions/actions/runs/2266490870)